In [157]:
import pandas as pd
import string
import numpy as np

In [140]:
addr = [
    '123 Main St., Pleasantville, IL, 99999',
    float('nan'),
    '678 Walnut St.,Pleasantville,,99999'
]
llr = ['Match', 'No_Match', 'Match']
df_out = pd.DataFrame({'last_lookup_result': llr, 'norm_address': addr})
df_out

  last_lookup_result                            norm_address
0              Match  123 Main St., Pleasantville, IL, 99999
1           No_Match                                     NaN
2              Match     678 Walnut St.,Pleasantville,,99999

In [131]:
addr = [ float('NaN'), float('NaN'), float('NaN'), float('NaN') ]
llr = [ 'No_Match', 'No_Match', 'No_Match', 'No_Match' ]
df_out = pd.DataFrame({'last_lookup_result': llr, 'norm_address': addr})
df_out

  last_lookup_result  norm_address
0           No_Match           NaN
1           No_Match           NaN
2           No_Match           NaN
3           No_Match           NaN

# Set norm_address to empty string for all No_Match records
# We ensure that all values are strings
df_out.loc[df_out['last_lookup_result']=='No_Match','norm_address'] = ''

In [141]:
df_out['norm_address'] = df_out['norm_address'].astype('str') # force all to be strings
malformed_index = df_out['norm_address'].str.count(',') != 3
df_out.loc[malformed_index,'norm_address'] = ',,,' # Replace "malformed" strings
#df_out.loc[~malformed_index,'norm_address'].str.strip()

In [142]:
df_out

  last_lookup_result                            norm_address
0              Match  123 Main St., Pleasantville, IL, 99999
1           No_Match                                     ,,,
2              Match     678 Walnut St.,Pleasantville,,99999

def split_norm_address(naddr):
    s = str(naddr)
    if s.count(',') != 3:
        return([['','','','']])
    else:
        return(s.split('\s*,\s*', expand=True))

#addr_split = df_out.loc[~malformed_index,'norm_address'].str.split('\s*,\s*', n=3, expand=True)
addr_split = df_out['norm_address'].apply(split_norm_address)
addr_split

In [143]:
addr = df_out['norm_address'].str.strip() # Pandas Series
addr_split = addr.str.split('\s*,\s*', n=3, expand=True)
addr_split.columns = ['norm_address_address', 'norm_address_city', 'norm_address_state', 'norm_address_zip']
addr_split

  norm_address_address norm_address_city norm_address_state norm_address_zip
0         123 Main St.     Pleasantville                 IL            99999
1
2       678 Walnut St.     Pleasantville                               99999

In [144]:
df_out = pd.concat([df_out, addr_split], axis=1)
df_out

,last_lookup_result,norm_address,norm_address_address,norm_address_city,norm_address_state,norm_address_zip
0,Match,"123 Main St., Pleasantville, IL, 99999",123 Main St.,Pleasantville,IL,99999
1,No_Match,",,,",,,,
2,Match,"678 Walnut St.,Pleasantville,,99999",678 Walnut St.,Pleasantville,,99999

In [145]:
x = ['1', '2.2', '3.x']
df = pd.DataFrame({'x': x})
df

     x
0    1
1  2.2
2  3.x

In [149]:
df['x'] = df['x'].apply(pd.to_numeric, errors='coerce')

In [150]:
df

     x
0  1.0
1  2.2
2  NaN

In [161]:
df_geo = pd.DataFrame({
    'lonlat': [ '-20.1234,20.1234', ' 43.3737, -39.8888', '29.1111,34.sdf000 ' ]
})
#df2 = pd.DataFrame(df_geo['lonlat'].str.strip().str.split('\s*,\s*', n=1).tolist(), columns=['lon', 'lat'])
df2 = pd.DataFrame(df_geo['lonlat'].str.strip().str.split('\s*,\s*', n=1).tolist(), columns=['lon', 'lat']).apply(pd.to_numeric, errors='coerce')
df2

       lon      lat
0 -20.1234  20.1234
1  43.3737 -39.8888
2  29.1111      NaN

In [160]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
lon    3 non-null float64
lat    3 non-null float64
dtypes: float64(2)
memory usage: 128.0 bytes